import 'package:flutter/material.dart';
import 'package:flutter_html/flutter_html.dart';

class Guidepage extends StatefulWidget {
  const Guidepage({super.key});

  @override
  State<Guidepage> createState() => _GuidepageState();
}

class _GuidepageState extends State<Guidepage> {
  @override
  Widget build(BuildContext context) {
    final htmldata =
        '''<p>मुनिसिपालिटी द्वारा परिभाषित नियम तथा विधिहरु पालन गरी शिकायत प्रबन्धन प्रणालीको प्रयोगको लागि नेपालीमा निर्देशिका</p>
<p>१. प्रणालीको प्रयोग गर्नुअघि मुनिसिपालिटी द्वारा परिभाषित नियम तथा विधि सम्बन्धी जानकारीहरु पढ्नुहोस्।</p>
<p>२. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि शिकायत दर्ता गर्नुपर्नेछ। शिकायत दर्ता गर्दा निम्न विवरणहरु पेश गर्नुपर्नेछ:</p>
<ul>
    <li>शिकायत गर्ने व्यक्तिको नाम</li>
    <li>ठेगाना</li>
    <li>सम्पर्क नम्बर</li>
    <li>शिकायत विवरण</li>
</ul>
<p>३. शिकायत दर्ता गर्ने व्यक्ति मुनिसिपालिटी द्वारा परिभाषित शुल्क तथा फारम पुरा गर्नुपर्नेछ।</p>
<p>४. शिकायत दर्ता पछि तपाईंलाई आफ्नो शिकायतको स्थिति जानकारी दिइने गरिएको हुनेछ।</p>
<p>५. शिकायत समाधान गरिने प्रक्रियामा समयैव सहयोग गर्नुपर्नेछ। मुनिसिपालिटीले शिकायतको समाधान गर्ने प्रक्रिया सम्बन्धी जानकारीहरु प्रदान गर्नेछ।</p>
<p>६. समस्या समाधान नभएमा तपाईंले मुनिसिपालिटीलाई पुन सम्पर्क गरी अत्यावश्यक सहयोग गर्नुपर्नेछ।</p>
<p>७. समस्या समाधान भएको छैन भने तपाईंले मुनिसिपालिटीलाई पुनः सम्पर्क गरी आफ्नो शिकायतको स्थिति जानकारी पाउन सक्नुहुनेछ।</p>
<p>८. संभव छाडिएका निष्कर्षहरुमा सन्तुलित रहनुहोस् र शिकायत प्रबन्धन प्रणालीको प्रयोग गर्ने समयमा मुनिसिपालिटीलाई अधिकृत सम्पर्क बनाएर समस्याको समाधान गर्न सहयोग गर्नुहोस्।</p>
<p>९. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि आफ्नो शिकायत सम्बन्धी जानकारी अवलोकन गर्नुहोस् र तपाईंको शिकायत पूर्णता रूपमा पेश हुनेछ भन्ने सुनिश्चित गर्नुहोस्।</p>
<p>१०. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि तपाईंले सम्बन्धित निकायमा शिकायत दर्ता गर्नुपर्ने वारे जानकारी ग्रहण गर्नुहोस्।</p>
<p>११. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि तपाईंले अपना शिकायत प्रस्तुत गर्नुपर्ने तालिका अवलोकन गर्नुहोस्।</p>
<p>१२. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि आफ्नो शिकायत सम्बन्धी निकायमा सम्पर्क गर्नुहोस्।</p>
<p>१३. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि समस्यालाई समयमा हल गर्न सक्षम रहनुहोस्।</p>
<p>१४. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि तपाईंले उपलब्ध जानकारीहरु पढ्नुहोस् र समस्याको समाधान गर्ने तरिका सम्बन्धी जान्नुहोस्।</p>
<p>१५. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि समस्याको अध्ययन गर्नुहोस् र समस्याको समाधान गर्न सहज तथा प्रभावकारी तरिकाहरु समझ्नुहोस्।</p>
<p>१६. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि समस्याको समाधान गर्न निकायको सहयोग लिनुपर्न सक्ने तरिकाहरु समझ्नुहोस्।</p>
<p>१७. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि अधिकृत रुपमा शिकायत दर्ता गर्नुपर्ने तरिकाहरु समझ्नुहोस्।</p>
<p>१८. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि तपाईंले विवरणहरु सही तथा असल रूपमा पेश गर्न सक्नुहुनेछ।</p>
<p>१९. शिकायत प्रबन्धन प्रणालीको प्रयोग गर्नुअघि समस्याको समाधान गर्न पूर्व समस्याको विस्तृत अध्ययन गर्न समय लग्न सक्छ।</p>
<p>२०. शिकायत प्रबन्धन प्रणाली नियमित रुपमा अद्यावधिक हुने गरी समस्या समाधान गर्न सक्षम बनाउनुहुनेछ।</p>''';
    return Scaffold(
        appBar: AppBar(
          title: Text('शिकायत प्रबन्धन प्रणाली'),
        ),
        body: SingleChildScrollView(
          padding: EdgeInsets.symmetric(horizontal: 10, vertical: 0),
          child: Html(
            data: htmldata,
            style: {
              '#': Style(fontSize: FontSize(20.0), color: Colors.black87),
            },
          ),
        ));
  }
}
